Part 1: Verify Basic Network Connectivity

Verify network connectivity prior to configuring the IP ACLs.

Step 1:      From PC-A, verify connectivity to PC-C and R2.

a.     From the command prompt, ping PC-C (192.168.3.3).

b.     From the command prompt, establish an SSH session to R2 Lo0 interface (192.168.2.1) using username SSHadmin and password ciscosshpa55. When finished, exit the SSH session.

SERVER> ssh -l SSHadmin 192.168.2.1

Step 2:      From PC-C, verify connectivity to PC-A and R2.

a.     From the command prompt, ping PC-A (192.168.1.3).

b.     From the command prompt, establish an SSH session to R2 Lo0 interface (192.168.2.1) using username SSHadmin and password ciscosshpa55. Close the SSH session when finished.

c.     Open a web browser to the PC-A server (192.168.1.3) to display the web page. Close the browser when done.

Part 2: Secure Access to Routers

Step 1:      Configure ACL 10 to block all remote access to the routers except from PC-C.

Use the access-list command to create a numbered IP ACL on R1, R2, and R3.

Step 2:      Apply ACL 10 to ingress traffic on the VTY lines.

Use the access-class command to apply the access list to incoming traffic on the VTY lines.

Step 3:      Verify exclusive access from management station PC-C.

a.     Establish an SSH session to 192.168.2.1 from PC-C (should be successful).

b.     Establish an SSH session to 192.168.2.1 from PC-A (should fail).

Part 3: Create a Numbered IP ACL 120 on R1

Step 1: Verify that PC-C can access the PC-A via HTTPS using the web browser. Be sure to disable HTTP and enable HTTPS on server PC-A.

Step 2: Configure ACL 120 to specifically permit and deny the specified traffic. Use the access-list command to create a numbered IP ACL.

R1(config)# access-list 120 permit udp any host 192.168.1.3 eq domain

R1(config)# access-list 120 permit tcp any host 192.168.1.3 eq smtp

R1(config)# access-list 120 permit tcp any host 192.168.1.3 eq ftp R1(config)# access-list 120 deny tep any host 192.168.1.3 eq 443

eq 22

R1(config)# access-list 120 permit top host 192.168.3.3 host 10.1.1.1

Step 3: Apply the ACL to interface S0/0/0.

R1(config)# interface s0/0/0

R1(config-if)# ip access-group 120 in

Step 4: Verify that PC-C cannot access PC-A via HTTPS using the web browser.

Emx Part 4: Modify an Existing ACL on R1

Step 1: Verify that PC-A cannot successfully ping the loopback interface on R2.

Step 2: Make any necessary changes to ACL 120 to permit and deny the specified traffic. RI (config)# access-list 120 permit icmp any any echo-reply

R1 (config)# access-list 120 permit icmp any any unreachable

R1 (config)# access-list 120 deny icmp any any

R1(config)# access-list 120 permit ip any any

Step 3: Verify that PC-A can successfully ping the loopback interface on R2.
Step 4:      Check results.

Your completion percentage should be 100%. Click Check Results to see feedback and verification of which required components have been completed.
